music/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        @all_bands  = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Vulfpeck"], ["created_at", "2021-02-09 22:10:49.925273"], ["updated_at", "2021-02-09 22:10:49.925273"]]
SELECT  "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "Vulfpeck"], ["LIMIT", 1]]
---
    def create
        @band = Band.new(band_params)

        if !Band.find_by(name: @band.name) && @band.save