music/app/models/user.rb

    def self.find_by_credentials(email,password)
        u = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "raydarth@gmail.com"], ["LIMIT", 1]]